{
    "title": "Domain 1.10: Identify common features and tools of the macOS/desktop OS.",
    "content": "<article>\n  <h2>💻 Installation and Uninstallation of Applications</h2>\n  <ul>\n    <li><strong>.dmg:</strong> Disk image used to install macOS software.</li>\n    <li><strong>.pkg:</strong> Installer package used for macOS applications.</li>\n    <li><strong>.app:</strong> The application bundle itself – drag to /Applications to install.</li>\n    <li><strong>App Store:</strong> Central location for downloading, updating, and managing apps.</li>\n    <li><strong>Uninstallation:</strong> Typically drag the .app file to the Trash to uninstall.</li>\n  </ul>\n\n  <h2>🍏 Apple ID and Corporate Restrictions</h2>\n  <ul>\n    <li><strong>Apple ID:</strong> Used for iCloud, App Store, Messages, and syncing devices.</li>\n    <li><strong>Corporate Restrictions:</strong> Managed via MDM tools (e.g., JAMF) to limit access, enforce policies.</li>\n  </ul>\n\n  <h2>🔧 Best Practices</h2>\n  <ul>\n    <li><strong>Backups:</strong> Use Time Machine or other tools to back up regularly.</li>\n    <li><strong>Antivirus:</strong> Protect against malware or phishing, especially in business environments.</li>\n    <li><strong>Updates/Patches:</strong> Keep system and apps up to date for security and performance.</li>\n  </ul>\n\n  <h2>⚙️ System Preferences</h2>\n  <ul>\n    <li><strong>Displays:</strong> Adjust resolution, scale, and arrangement for multiple monitors.</li>\n    <li><strong>Networks:</strong> Set Wi-Fi, Ethernet, VPN, and proxy options.</li>\n    <li><strong>Printers/Scanners:</strong> Add and manage local or network printers and scanners.</li>\n    <li><strong>Privacy:</strong> Manage app permissions for camera, microphone, location, etc.</li>\n    <li><strong>Accessibility:</strong> Configure tools for visual, hearing, or motor accessibility needs.</li>\n    <li><strong>Time Machine:</strong> Built-in backup tool that auto-saves versions and backups to external drives.</li>\n  </ul>\n\n  <h2>💻 Features</h2>\n  <ul>\n    <li><strong>Multiple Desktops:</strong> Organize workspaces across virtual desktops.</li>\n    <li><strong>Mission Control:</strong> View and manage all open windows and desktops.</li>\n    <li><strong>Keychain:</strong> Store passwords and credentials securely.</li>\n    <li><strong>Spotlight:</strong> Search bar to find files, apps, documents, and perform calculations/web searches.</li>\n    <li><strong>iCloud:</strong> Syncs files, photos, messages across Apple devices.</li>\n    <li><strong>Gestures:</strong> Use trackpad gestures to navigate quickly (e.g., swipe between desktops).</li>\n    <li><strong>Finder:</strong> The file explorer for macOS.</li>\n    <li><strong>Remote Disc:</strong> Access discs from another Mac or networked device.</li>\n  </ul>\n\n  <h2>🛠️ Disk Utility</h2>\n  <p>Use to erase, partition, and repair drives. Also helps check for drive errors and format new disks.</p>\n\n  <h2>🔒 FileVault</h2>\n  <p>Encrypts your entire hard drive for maximum security. Requires password or recovery key to unlock.</p>\n\n  <h2>💻 Terminal</h2>\n  <p>Command-line tool for advanced users. Use it to navigate, install packages, or write shell scripts.</p>\n\n  <h2>🚫 Force Quit</h2>\n  <p>Use Command + Option + Esc to open Force Quit window and close frozen apps.</p>\n</article>"
  }
  