{
    "title": "Domain 1.4: Given a scenario, use the appropiate Microsoft Windows Control Panel utility.",
    "content": "<article>\n  <h2>⚙️ Microsoft Windows 10 Control Panel Utilities (Core Set)</h2>\n  <ul>\n    <li><strong>Internet Options:</strong> Manage browser settings, cookies, and security zones (mainly for Internet Explorer).</li>\n    <li><strong>Devices and Printers:</strong> View and manage connected hardware like printers and peripherals.</li>\n    <li><strong>Programs and Features:</strong> Uninstall programs or modify Windows features.</li>\n    <li><strong>Network and Sharing Center:</strong> Adjust network adapter settings and manage profiles.</li>\n    <li><strong>System:</strong> See system specs, OS version, activation, and advanced system settings.</li>\n    <li><strong>Windows Defender Firewall:</strong> Configure firewall settings and application rules.</li>\n    <li><strong>Mail:</strong> Manage Outlook profiles and data files (shows if Outlook is installed).</li>\n    <li><strong>Sound:</strong> Choose and configure audio input/output devices.</li>\n    <li><strong>User Accounts:</strong> Manage user types, credentials, and UAC settings.</li>\n  </ul>\n\n  <h2>🧰 Mid-Level Control Panel Utilities</h2>\n  <ul>\n    <li><strong>Device Manager:</strong> Update, disable, or troubleshoot hardware components.</li>\n    <li><strong>Indexing Options:</strong> Control what content Windows Search indexes for faster results.</li>\n    <li><strong>Administrative Tools:</strong> Access Event Viewer, Services, Performance Monitor, and more.</li>\n  </ul>\n\n  <h2>🗂️ File Explorer Options</h2>\n  <ul>\n    <li><strong>Show hidden files:</strong> View normally hidden system folders.</li>\n    <li><strong>Hide extensions:</strong> Toggle file extension visibility.</li>\n    <li><strong>General options:</strong> Control file/folder behavior (e.g., single-click open).</li>\n    <li><strong>View options:</strong> Change folder display layout and apply across all folders.</li>\n  </ul>\n\n  <h2>⚡ Power Options</h2>\n  <ul>\n    <li><strong>Hibernate:</strong> Saves session to disk; turns off the PC completely.</li>\n    <li><strong>Power plans:</strong> Choose energy profiles like Balanced, Power Saver, or High Performance.</li>\n    <li><strong>Sleep/Suspend:</strong> Keeps RAM active for quick resume.</li>\n    <li><strong>Standby:</strong> Similar to Sleep (low-power mode).</li>\n    <li><strong>Choose what closing the lid does:</strong> Define sleep/hibernate/shutdown behavior for laptops.</li>\n    <li><strong>Turn on fast startup:</strong> Hybrid boot for faster reboots.</li>\n    <li><strong>USB selective suspend:</strong> Saves power by disabling unused USB ports.</li>\n  </ul>\n\n  <h2>🧑‍🦽 Ease of Access</h2>\n  <p>Accessibility features for visual, auditory, or physical impairments. Includes narrator, magnifier, sticky keys, high contrast, and more.</p>\n</article>"
  }
  