{
    "title": "Domain 1.9: Given a scenario, perform OS installations and upgrades in a diverse OS environment.",
    "content": "<article>\n  <h2>💻 Boot Methods</h2>\n  <ul>\n    <li><strong>USB:</strong> Common method using a bootable USB drive with the OS installer.</li>\n    <li><strong>Optical Media:</strong> Boot from CD/DVD — used less now but still supported.</li>\n    <li><strong>Network (PXE):</strong> Installs OS over the network, ideal for enterprise deployments.</li>\n    <li><strong>Solid-state/Flash Drives:</strong> Use external flash-based storage for OS installation.</li>\n    <li><strong>Internet-Based:</strong> Boot directly from cloud or internet-based server.</li>\n    <li><strong>External/Hot-Swappable Drives:</strong> Boot from external HDDs or SSDs.</li>\n    <li><strong>Internal Hard Drive (Partition):</strong> Boot and install from a local recovery or setup partition.</li>\n  </ul>\n\n  <h2>🔧 Types of Installations</h2>\n  <ul>\n    <li><strong>Upgrade:</strong> Install newer OS version while keeping files/apps/settings.</li>\n    <li><strong>Recovery Partition:</strong> Restore from pre-installed OEM recovery partition.</li>\n    <li><strong>Clean Install:</strong> Full OS install — wipes existing data.</li>\n    <li><strong>Image Deployment:</strong> Uses a system image to quickly install OS and apps.</li>\n    <li><strong>Repair Installation:</strong> Fixes a broken OS without deleting files.</li>\n    <li><strong>Remote Network Installation:</strong> Install via network (e.g., PXE boot or WDS).</li>\n    <li><strong>Other Considerations:</strong> Ensure third-party drivers are loaded during install if needed (e.g., RAID, GPU, Wi-Fi).</li>\n  </ul>\n\n  <h2>💽 Drive Format & Upgrade Considerations</h2>\n  <ul>\n    <li><strong>Backup Files and Settings:</strong> Always back up before upgrading to avoid data loss.</li>\n    <li><strong>App and Driver Compatibility:</strong> Check if older software and hardware work with the new OS.</li>\n    <li><strong>Hardware Compatibility:</strong> Ensure that the system meets OS requirements and drivers are available.</li>\n    <li><strong>Product Life Cycle:</strong> Make sure the OS version isn't near end-of-life and will receive updates.</li>\n  </ul>\n</article>"
  }
  