{
    "title": "Domain 2.1: Summarize various security measures and their purposes. ",
    "content": "<article>\n  <h2>🔐 Physical Security</h2>\n  <ul>\n    <li><strong>Access Control Vestibule:</strong> A controlled entry point that requires authentication (e.g., card reader, fingerprint scanner).</li>\n    <li><strong>Badge Reader:</strong> Uses an identification card or badge to control access to secured areas.</li>\n    <li><strong>Video Surveillance:</strong> Cameras installed to monitor and record activities, deterring crime and identifying perpetrators.</li>\n    <li><strong>Alarm Systems:</strong> Detect unauthorized entry or breaches, triggering alerts or contacting authorities.</li>\n    <li><strong>Motion Sensors:</strong> Detect movement and trigger alerts in a designated area.</li>\n    <li><strong>Door Locks:</strong> Electronic or mechanical mechanisms to control access.</li>\n    <li><strong>Equipment Locks:</strong> Prevent theft or tampering of hardware, especially in public/shared spaces.</li>\n    <li><strong>Guards:</strong> Security personnel who monitor systems and patrol facilities.</li>\n    <li><strong>Bollards:</strong> Posts that prevent vehicle access to protected areas.</li>\n    <li><strong>Fences:</strong> Perimeter barriers to prevent unauthorized physical access.</li>\n  </ul>\n\n  <h3>👥 Physical Security for Staff</h3>\n  <ul>\n    <li><strong>Key Fobs:</strong> Small electronic devices for secure access.</li>\n    <li><strong>Smart Cards:</strong> Cards with embedded chips for identification/access.</li>\n    <li><strong>Keys:</strong> Traditional mechanical access tools.</li>\n    <li><strong>Biometrics:</strong> Access via physical traits like fingerprints or facial recognition.</li>\n  </ul>\n\n  <h2>🔒 Logical Security</h2>\n  <ul>\n    <li><strong>Principle of Least Privilege:</strong> Limit user/system access to only what is needed.</li>\n    <li><strong>Access Control Lists (ACLs):</strong> Define who can access a resource and how.</li>\n    <li><strong>Multifactor Authentication (MFA):</strong> Requires two or more verification methods (e.g., password + fingerprint).</li>\n    <li><strong>Email:</strong> Secure accounts with encryption, strong passwords, and MFA.</li>\n    <li><strong>Hard Token:</strong> Physical device generating time-based login codes.</li>\n    <li><strong>Soft Token:</strong> App-based code generator on a smartphone.</li>\n    <li><strong>SMS:</strong> Sends authentication codes via text message.</li>\n    <li><strong>Voice Call:</strong> Sends codes by phone call.</li>\n    <li><strong>Authenticator Application:</strong> Apps like Google Authenticator for MFA.</li>\n  </ul>\n\n  <h2>📱 Mobile Device Management (MDM)</h2>\n  <ul>\n    <li><strong>Login Script:</strong> Auto-run scripts to configure devices on login.</li>\n    <li><strong>Domain:</strong> Centralized device/user management network.</li>\n    <li><strong>Group Policy/Updates:</strong> Enforce rules and push updates.</li>\n    <li><strong>Organizational Units:</strong> Logical groups for targeted policy application.</li>\n    <li><strong>Home Folder:</strong> Network folder for storing user data.</li>\n    <li><strong>Folder Redirection:</strong> Redirects user folders to a network location.</li>\n    <li><strong>Security Groups:</strong> Define security permissions per user/device group.</li>\n  </ul>\n\n  <h2>🔐 Active Directory (AD)</h2>\n  <ul>\n    <li><strong>Login Script:</strong> Scripts that run at user login for environment setup.</li>\n    <li><strong>Domain:</strong> A managed group of devices/resources with centralized control.</li>\n    <li><strong>Group Policy/Updates:</strong> Define and enforce system/user policies.</li>\n    <li><strong>Organizational Units (OUs):</strong> Organize AD objects by group/department.</li>\n    <li><strong>Home Folder:</strong> Server-based personal storage folder.</li>\n    <li><strong>Folder Redirection:</strong> Stores Documents/Desktop folders on a network location.</li>\n    <li><strong>Security Groups:</strong> Apply access control across users and devices.</li>\n  </ul>\n</article>"
  }
  