{
    "title": "Domain 2.3: Given a scenario, detect, remove, and prevent malware using the appropriate tools and methods.",
    "content": "<article>\n  <h2>🦠 Malware Types</h2>\n  <ul>\n    <li><strong>Trojan:</strong> Disguises as legitimate software. Once run, it can steal data or create backdoors.</li>\n    <li><strong>Rootkit:</strong> Grants unauthorized root/admin access and hides its presence. Very stealthy.</li>\n    <li><strong>Virus:</strong> Attaches to legitimate files and spreads when those files are shared. Can damage or crash systems.</li>\n    <li><strong>Spyware:</strong> Secretly collects user info, like browsing data or login credentials.</li>\n    <li><strong>Ransomware:</strong> Encrypts files or locks systems until a ransom is paid.</li>\n    <li><strong>Keylogger:</strong> Records every keystroke, often used to steal passwords or credit card data.</li>\n    <li><strong>Boot Sector Virus:</strong> Infects the boot sector and activates during startup. Can prevent booting entirely.</li>\n    <li><strong>Cryptominers:</strong> Uses system resources to mine cryptocurrency, slowing performance and damaging hardware.</li>\n  </ul>\n\n  <h2>🛠️ Malware Detection & Prevention Tools</h2>\n  <ul>\n    <li><strong>Recovery Mode:</strong> Safe environment to troubleshoot, restore, or repair malware-infected systems.</li>\n    <li><strong>Antivirus:</strong> Scans for and removes known threats like viruses and worms. Needs frequent updates.</li>\n    <li><strong>Anti-malware:</strong> Targets modern threats like spyware, ransomware, and rootkits.</li>\n    <li><strong>Software Firewalls:</strong> Filters traffic and blocks suspicious connections.</li>\n    <li><strong>Anti-phishing Training:</strong> Educates users to avoid malicious emails and websites.</li>\n    <li><strong>User Education:</strong> Helps recognize common cyber threats and avoid risky behaviors.</li>\n    <li><strong>OS Reinstallation:</strong> Wipes the system clean and removes stubborn infections. Back up data first.</li>\n  </ul>\n</article>"
  }
  