{
    "title": "Domain 2.4: Explain common social-engineering attacks, threats, and vulnerabilities.",
    "content": "<article>\n  <h2>🧠 Social Engineering Attacks</h2>\n  <ul>\n    <li><strong>Phishing:</strong> Deceptive emails or websites that steal personal info like passwords or credit cards.</li>\n    <li><strong>Vishing:</strong> Phone-based phishing that tricks users into revealing sensitive info.</li>\n    <li><strong>Shoulder Surfing:</strong> Observing someone to get private info like PINs or passwords.</li>\n    <li><strong>Whaling:</strong> Spear-phishing targeting executives (e.g., CEO/CFO) for sensitive company info.</li>\n    <li><strong>Tailgating:</strong> Unauthorized access by following someone into a secure area.</li>\n    <li><strong>Impersonation:</strong> Pretending to be someone else (e.g., IT staff) to access restricted data or areas.</li>\n    <li><strong>Dumpster Diving:</strong> Searching trash for confidential data like passwords or sensitive docs.</li>\n    <li><strong>Evil Twin:</strong> Fake Wi-Fi hotspot designed to steal data from connected users.</li>\n  </ul>\n\n  <h2>🚨 Cyber Threats</h2>\n  <ul>\n    <li><strong>DDoS:</strong> Overwhelms a system with traffic from multiple sources to crash or slow it down.</li>\n    <li><strong>DoS:</strong> Same goal as DDoS but from one source — flood with traffic to make it unusable.</li>\n    <li><strong>Zero-Day:</strong> Exploits an unknown vulnerability before a patch is available.</li>\n    <li><strong>Spoofing:</strong> Masquerading as a trusted source (IP/email/site) to steal info or trick users.</li>\n    <li><strong>On-path Attack:</strong> Intercepts data between two parties without them knowing (MITM).</li>\n    <li><strong>Brute-Force:</strong> Trying all possible password combos until one works — slow but effective.</li>\n    <li><strong>Dictionary Attack:</strong> Uses a list of common words to guess passwords faster than brute force.</li>\n    <li><strong>Insider Threat:</strong> Threat comes from within the organization (employee/contractor misuse).</li>\n    <li><strong>SQL Injection:</strong> Inserts malicious SQL into forms or URLs to manipulate databases.</li>\n    <li><strong>XSS:</strong> Injects malicious scripts into web pages to steal user data or hijack sessions.</li>\n  </ul>\n\n  <h2>🔓 Vulnerabilities</h2>\n  <ul>\n    <li><strong>Non-compliant Systems:</strong> Don't meet required security standards — easily exploitable.</li>\n    <li><strong>Unpatched Systems:</strong> Miss critical updates, leaving known holes open to attackers.</li>\n    <li><strong>Unprotected Systems:</strong> Lacking antivirus/firewall — high risk for malware and intrusions.</li>\n    <li><strong>EOL Operating Systems:</strong> No longer supported or updated — major security holes.</li>\n    <li><strong>BYOD:</strong> Personal devices used at work — difficult to secure and manage consistently.</li>\n  </ul>\n</article>"
  }
  