{
    "title": "Domain 2.1: Compare and contrast common threat actors and motivations.",
    "content": "<article>\n  <h2>🎭 Threat Actors</h2>\n  <ul>\n    <li><strong>Nation-state:</strong> Government-sponsored, highly skilled, and well-funded. Goals: cyber-espionage, sabotage, and national defense.</li>\n    <li><strong>Script kiddie:</strong> Unskilled attacker using pre-made tools. Low sophistication, but still dangerous.</li>\n    <li><strong>Hacktivist:</strong> Politically or socially motivated attacker. Focused on disruption, defacement, and leaks.</li>\n    <li><strong>Insider threat:</strong> Authorized user misusing access—can be accidental or malicious.</li>\n    <li><strong>Organized crime:</strong> Profit-focused and structured. Known for ransomware, identity theft, and fraud.</li>\n    <li><strong>Shadow IT:</strong> Employees using unauthorized tech or apps that bypass security policies.</li>\n  </ul>\n\n  <h2>🧬 Attributes of Threat Actors</h2>\n  <ul>\n    <li><strong>Internal vs. External:</strong> Internal actors are within the org (employees); external actors are outside (hackers, competitors).</li>\n    <li><strong>Resources/Funding:</strong> The more resources, the more advanced the attack. Nation-states and crime groups rank highest.</li>\n    <li><strong>Level of Sophistication:</strong> Can range from phishing and malware to zero-day exploits and social engineering.</li>\n  </ul>\n\n  <h2>🎯 Motivations</h2>\n  <ul>\n    <li><strong>Data exfiltration:</strong> Stealing sensitive info for resale, extortion, or espionage.</li>\n    <li><strong>Espionage:</strong> Secret surveillance or theft of strategic info (corporate or national).</li>\n    <li><strong>Service disruption:</strong> Interrupts business (e.g., via DDoS or ransomware).</li>\n    <li><strong>Blackmail:</strong> Threatens to release/destroy data unless paid.</li>\n    <li><strong>Financial gain:</strong> Main driver for cybercrime—fraud, ransomware, and theft.</li>\n    <li><strong>Philosophical/political beliefs:</strong> Hacktivists attacking based on causes or ideologies.</li>\n    <li><strong>Ethical:</strong> White-hats exposing vulnerabilities to improve security (e.g., bug bounty hunters).</li>\n    <li><strong>Revenge:</strong> Angry insiders or former employees seeking retaliation.</li>\n    <li><strong>Disruption/chaos:</strong> Some act for fun, recognition, or anarchy—often unskilled or thrill-seeking.</li>\n    <li><strong>War:</strong> Cyberwarfare to disrupt infrastructure or gain strategic advantage.</li>\n  </ul>\n</article>"
  }
  