{
    "title": "Domain 5.4: Given a scenario, troubleshoot common performance issues.",
    "content": "<article>\n  <h2>🚦 Congestion/Contention</h2>\n  <p><strong>Definition:</strong> Too many devices or processes competing simultaneously for network resources.</p>\n  <p><strong>Indicators:</strong> Slow network speeds, frequent collisions, inconsistent connection.</p>\n  <p><strong>Real-world:</strong> High congestion occurs during peak hours when many employees simultaneously stream videos or download large files.</p>\n\n  <h2>⏳ Bottlenecking</h2>\n  <p><strong>Definition:</strong> Single network component limiting overall network performance.</p>\n  <p><strong>Indicators:</strong> Performance drop at a specific device (e.g., router or switch), limited data flow despite good connectivity.</p>\n  <p><strong>Real-world:</strong> Using an outdated switch with 100Mbps ports in a network otherwise running at gigabit speeds.</p>\n\n  <h2>📶 Bandwidth (Throughput Capacity)</h2>\n  <p><strong>Definition:</strong> Maximum data transfer rate supported by a network.</p>\n  <p><strong>Indicators:</strong> Slow downloads/uploads, streaming buffering, poor file-transfer speeds.</p>\n  <p><strong>Real-world:</strong> Employees complain of slow access when streaming video conferences due to insufficient internet bandwidth.</p>\n\n  <h2>🐢 Latency</h2>\n  <p><strong>Definition:</strong> Delay between data being sent and received.</p>\n  <p><strong>Indicators:</strong> Slow webpage load times, noticeable delay in voice/video calls.</p>\n  <p><strong>Real-world:</strong> Remote workers experiencing lag in VPN connections due to geographical distance or routing issues.</p>\n\n  <h2>📦 Packet Loss</h2>\n  <p><strong>Definition:</strong> Data packets fail to reach their destination.</p>\n  <p><strong>Indicators:</strong> Connection interruptions, poor-quality voice/video calls, incomplete file transfers.</p>\n  <p><strong>Real-world:</strong> Video conferencing apps freezing or skipping frames due to high packet loss on the network.</p>\n\n  <h2>🌊 Jitter</h2>\n  <p><strong>Definition:</strong> Variation in latency causing inconsistent delays.</p>\n  <p><strong>Indicators:</strong> Distorted or choppy audio/video communications.</p>\n  <p><strong>Real-world:</strong> VoIP calls sounding robotic or distorted due to inconsistent timing between packets.</p>\n</article>\n\n<article>\n  <h2>📡 Wireless Issues</h2>\n  <h3>📻 Interference</h3>\n  <p><strong>Definition:</strong> Disruption caused by devices/signals operating on similar frequencies.</p>\n  <p><strong>Channel Overlap:</strong> Multiple wireless networks using the same or adjacent channels causing signal interference.</p>\n  <p><strong>Indicators:</strong> Frequent disconnects, inconsistent wireless performance.</p>\n  <p><strong>Real-world:</strong> Office Wi-Fi affected by neighbors’ Wi-Fi networks set to the same channel (e.g., channel 6).</p>\n\n  <h3>📉 Signal Degradation or Loss</h3>\n  <p><strong>Definition:</strong> Weakening wireless signals over distance or obstacles.</p>\n  <p><strong>Indicators:</strong> Weak signal bars, dropped connections, slow wireless speed.</p>\n  <p><strong>Real-world:</strong> Users far from AP experiencing slow or intermittent connectivity.</p>\n\n  <h3>📍 Insufficient Wireless Coverage</h3>\n  <p><strong>Definition:</strong> Areas lacking adequate Wi-Fi signal strength.</p>\n  <p><strong>Indicators:</strong> Dead zones, inconsistent connectivity in certain locations.</p>\n  <p><strong>Real-world:</strong> Poor coverage in large meeting rooms or basements due to inadequate access point placement.</p>\n\n  <h3>🔗 Client Disassociation Issues</h3>\n  <p><strong>Definition:</strong> Devices repeatedly disconnecting from wireless AP.</p>\n  <p><strong>Indicators:</strong> Frequent disconnects, clients needing to reconnect manually.</p>\n  <p><strong>Real-world:</strong> Smartphones frequently disconnecting due to AP overload or incompatible security settings.</p>\n\n  <h3>🔄 Roaming Misconfiguration</h3>\n  <p><strong>Definition:</strong> Devices unable to seamlessly transition between APs.</p>\n  <p><strong>Indicators:</strong> Dropped connections when users move around an office.</p>\n  <p><strong>Real-world:</strong> Employees experiencing dropped video calls when moving between office floors due to incorrect AP roaming settings.</p>\n</article>"
  }
  