{
    "title": "Domain 1.1: Given a scenario, install and configure laptop hardware components",
    "content": "<article>\n  <!-- Main heading for the topic -->\n  <h2>🧰 INSTALLING & CONFIGURING LAPTOP HARDWARE + SECURITY COMPONENTS</h2>\n\n  <section>\n    <h3>🔋 1. Battery Replacement</h3>\n    <p>\n      Removable batteries (older laptops): Slide a latch, pop it out.<br />\n      Integrated batteries (newer ultrabooks): Require removing screws and the back panel.\n    </p>\n    <p>\n      ⚠️ <strong>ESD Safety Tip:</strong> Always turn off the device, unplug the power source,\n      and ground yourself before opening.\n    </p>\n    <p>\n      🧠 <strong>EXAM TIP:</strong> Know how to identify removable vs. non-removable batteries.\n      Be ready to answer which tools you’d use (like a plastic spudger or screwdriver).\n    </p>\n  </section>\n\n  <section>\n    <h3>🎹 2. Keyboard Replacement</h3>\n    <p>\n      Most laptop keyboards are attached with screws and a thin ribbon cable.\n      Replacing one often requires removing the top panel or palm rest.<br />\n      Common issues: dead keys, water damage, or physical damage.\n    </p>\n    <p>\n      🧠 <strong>EXAM TIP:</strong> You might see a diagram and be asked where the ribbon cable connects.\n      Know that ribbon cables go to ZIF (Zero Insertion Force) connectors.\n    </p>\n  </section>\n\n  <section>\n    <h3>🧠 3. RAM Replacement/Upgrade</h3>\n    <p>\n      SODIMM (Small Outline Dual In-line Memory Module) is used in laptops.<br />\n      Usually accessible through a bottom panel or under the keyboard.\n      Push clips outward → RAM pops up → insert new one at a 45° angle.\n    </p>\n    <p>\n      🧠 <strong>EXAM TIP:</strong> Know that adding more RAM improves multitasking and performance.\n      Also recognize SODIMM vs. DIMM.\n    </p>\n  </section>\n\n  <section>\n    <h3>💾 4. HDD/SSD Replacement or Migration</h3>\n    <p>\n      Laptops use 2.5\" SATA HDDs/SSDs, NVMe M.2 SSDs, or both.<br />\n      Migration = moving OS and data to a new drive using cloning software\n      (e.g., Macrium Reflect, Clonezilla).<br />\n      Replacement = physically removing the old drive and installing a new one.\n    </p>\n    <p>\n      🧠 <strong>EXAM TIP:</strong> Know which tools are needed (e.g., Phillips screwdriver),\n      what form factors to expect (2.5\", M.2), and what cloning means.\n    </p>\n  </section>\n\n  <section>\n    <h3>📶 5. Wireless Card Replacement</h3>\n    <p>\n      Usually a mini PCIe or M.2 card, often under a back panel.\n      Connected to antenna wires (black/white) that clip on. Secure with screws.\n    </p>\n    <p>\n      🧠 <strong>EXAM TIP:</strong> You may see questions on which wires are used for Wi-Fi antennas.\n      Know where this card is located and how to identify it.\n    </p>\n  </section>\n\n  <section>\n    <h3>🔐 6. Biometrics</h3>\n    <p>\n      Devices that use fingerprint scanners, face recognition, etc.,\n      usually built into the palm rest or near the touchpad.\n    </p>\n    <p>\n      🧠 <strong>EXAM TIP:</strong> Biometrics is part of physical security.\n      Know what it protects (device access, data) and how it’s configured\n      (usually in the OS or BIOS/UEFI).\n    </p>\n  </section>\n\n  <section>\n    <h3>📡 7. Near-Field Scanner Features (NFC)</h3>\n    <p>\n      NFC (Near Field Communication) allows short-range communication\n      (about 4 cm). Used for tap-to-pay, smartcard logins, and device pairing.<br />\n      Some laptops have NFC sensors embedded in the palm rest or under the keyboard.\n    </p>\n    <p>\n      🧠 <strong>EXAM TIP:</strong> Know that NFC is short-range. Differentiate it from Bluetooth or Wi-Fi.\n    </p>\n  </section>\n</article>"
  }
  